// JSON Document
{
  "records": [{
    "id": "1",
    "name": "BlueWillowPlate",
    "text": "Got a question for all the ladies out there, particularly ones in there 20's and 30's. What's your opinion about guys wearing earrings. Now, I'm not talking about the huge dangling body piercing style earrings or the gigantic diamonds rappers wear. I'm just talking about a small hoop or stud in the left (or both) ears. Some say, some guys look good wearing one. Others don't What kind of guys look good in an earring? What kind of look (hair styles\/clothing) do you think go well with one? Just looking for opinions here.",
    "post_date": "2020-05-31 12:33:21",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "2",
    "name": "TheImportersWife",
    "text": "What are some opinions of a 15-year-old boy who wears earrings? What is an appropriate age for a child to get their ears pierced?",
    "post_date": "2020-05-31 13:56:42",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "3",
    "name": "Lindsey_Mcfarren",
    "text": "If you wear earrings on both sides of your ears, does that mean you’re bi?",
    "post_date": "2020-05-31 14:01:24",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "4",
    "name": "Marylandkitten",
    "text": "Did you know? Men, were the first people in history to wear earrings. Used for body modification, accessorizing garments and keeping in trends, earrings have been among us since the beginning of time. With the changing times and cultures, many stereotypes have been raised and quelled with all genders falling for the allure of these tiny ornaments. It’s considered normal for females but for the males, questions arise as to why guys wear earrings at all.",
    "post_date": "2020-05-31 14:06:36",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "5",
    "name": "Summering",
    "text": "Yuk. Can't stand earrings on men. Of any kind at all. I think a lot of guys are getting too \"femmy\". I don't like men wearing jewelry, or styling their hair, either. I don't mean like using gel and a comb to keep it tidy, that's fine, but going to the salon to have it styled and highlighted and straightened and all that stuff. That's not what men do, at least in my book. I'm kinda old school when it comes to how people dress and present themselves. When I see a guy and he looks all \"done up\" with the fake hair, fake tan, earrings, etc...",
    "post_date": "2020-05-31 17:29:11",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "6",
    "name": "MooksterL1",
    "text": "HOOP EARRINGS CRITICISED AS CULTURAL APPROPRIATION\r\n'A style that links so heavily with identity is not taken seriously until it is seen on a white woman' What are your thoughts? ",
    "post_date": "2020-05-31 19:35:21",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "7",
    "name": "babigyrl5",
    "text": "I LOVE the look of stretched ears on guys. Maybe it's because I have them too, but I've always been attracted to the tattooed, stretched ears rocker type of guy. My boyfriend doesn't have any piercings or tattoos though, so it goes to show you that you fall for the person him\/herself and not what they look like",
    "post_date": "2020-05-31 19:39:37",
    "likes": "0",
    "reply_to": null
  }, {
    "id": "8",
    "name": "gizmo980",
    "text": "No, it doesn't. I've heard it all…that's like, if you were a boy and wear your one earring on the right, your gay. So false…that might have been the way back in the 80's, but this is 2018. Things change…get with the times. It couldn't mean you sleep on the left and don't want to irritate it. LoL people say the weirdest things sometimes. As far as I'm concerned, only a bully would poke fun and say something like that.",
    "post_date": "2020-05-31 19:48:55",
    "likes": "0",
    "reply_to": "3"
  }, {
    "id": "9",
    "name": "user30320407",
    "text": "Did he buy the earrings? If yes, nothing. If someone else bought them and gave them to him, then nothing. If you bought them, and don’t want him wearing them, then take them away. Simple as that.\r\n\r\nAs of the time I’m writing this, you’ve presented no reason that he shouldn’t wear them, so I’m going to assume that there’s no good reason he shouldn’t. As such, let him go for it.",
    "post_date": "2020-05-31 19:52:43",
    "likes": "0",
    "reply_to": "2"
  }, {
    "id": "10",
    "name": "user30320407",
    "text": "Um…no. Having earrings on both ears means you have earrings on both ears. And if you’re attracted to men and women then you’re bisexual. Totally separate. If we’re going to talk about the social silliness that were popular in the 70’s and perpetuated to the late 90's (the form of thinking thankfully much rarer now) even then, no, there was never a social stereotype of ‘both ears’. It started with popular gay icons and men in general seeming to prefer the left ear for getting pierced, and jewellery seen as a more feminine practice was teased.",
    "post_date": "2020-05-31 19:56:55",
    "likes": "0",
    "reply_to": "3"
  }, {
    "id": "11",
    "name": "pitt_transplant",
    "text": "I love earrings on a man, but it really depends on the jewelry and the man. I once dated a guy with one in each ear, the septum, tongue, belly button and both nipples. A bit much, but it looked sexy on him! Anyway, as long as it doesn't look too \"hair-band\" I'm all for them. My favorite jewelry, btw, is the circular barbell with captive or screwed-on beads... that's what I wear in my upper ear piercings. About the hair style, I think any hairdo can work with an earring.",
    "post_date": "2020-05-31 20:00:38",
    "likes": "0",
    "reply_to": "1"
  }]
}
